[{"tour":{"name":"Vietnam - North to South 10 days (incl. 1 free data sim card + entry to the Artinus 3D Art museum)","duration":10,"travelStyle":["Adventure","Family","Private","Group","Fully Guided","Discovery","Christmas & New Year"],"oldPrice":0,"price":712,"summary":"Guaranteed to depart! This tour is guaranteed to depart, so even if you're the only passenger confirmed, your tour will still go ahead as planned!","highlights":["Snorkel in Halong Bay","Explore the emerald waters of Luon Cave","Float down the Mekong Delta"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/100047_2ec113.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/100047_2ec113.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_b16df848.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_34e6c5f1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_b9415985.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_953b1eba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_9d8320c0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_78e32f0d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_eefbb66f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_0e0f7c74.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_a92e17ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_87d21746.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_4f997422.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_c6b69a1c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_1c01c8ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_d9f08c2b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_98998448.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_d3dda285.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_b44453ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_bb361da8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_83a2b202.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_7a5e76ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_efc3ed13.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_281e6007.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_90a6e012.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Ben Tre","Cu Chi Tunnels"],"timeline":[{"title":"Day 1 HA NOI ARRIVAL","description":"In and around Da NangMeal not included On arrival Ha Noi capital, we will see at the airport have private transfer to center for check in hotel. You have free time for leisure. Overnight in Hanoi.Start point\n Your hotel located , Hanoi, Vietnam "},{"title":"Day 2 HA NOI – HA LONG","description":"Meal included: Breakfast, Lunch,Dinner (Your hotel – Tuan Chau marina – Halong bay – Lunch– Surprising Cave – Titop Island – Sunset party – Dinner – Onboard night activities) 07.45 – 08.15 approx – Our guide will meet you at your hotel. The shuttle bus or private car pick up – Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta – Get your camera ready to take photos. Comfort break. The time from Hanoi to Halong bay is approximately 3 ½ hours.  12 – 12.30 approx – Arriving Tuan Chau marina. Welcome aboard the cruise. Refresh with our welcome drink. Meet the captain, crew in the cruise briefing. – Check into your cabin. Time to refresh and unwind – Set sail as lunch is served – Join us for a typical local lunch in the dining room or at the outdoor dining area.  Afternoon – Arrive at Surprising Cave (Hang Sửng Sốt), explore the cave and find out how the cave was named a Surprising. – Heading to Titop island area. Drop anchor in the calm water surrounded by beautiful islets. Visit Titop island for swimming and snorkeling or do the short trek to the top of island to have the overview of Halong bay from here – Heading back toward the sleeping area  Early evening – Summit on the sundeck watching the sunset, enjoy Sunset party. It’s ideal time to make acquaintance with new friends, sharing your traveling experience or simply watching the sunset – An authentic Vietnamese menu is served – After dinner, reward yourself with a large selection of cocktails at our bar, or take for you one of our onboard activities: book reading, games, movies, and squid fishing…Overnight on cruise"},{"title":"Day 3 HA LONG - HANOI","description":"In and around HanoiMeal included: Breakfast, Lunch (Tai Chi – Breakfast – Luon Cave – Cooking Demonstration – Lunch – Farewell at your hotel) 06:30 For the early risers join us for a Tai Chi session on the sundeck. Tai chi helps focus the mind and condition the body, joining Tai Chi session to full charge your energy for the day.  07:00 – 08:00 Local breakfast is served  08:00 – Mingling yourself in the stunning views of the Bay and it’s dramatic limestone islets as we sail through the calm emerald waters heading to Luon Cave (Hang Luồn) – Take your option either exploring the cave yourself on kayak or comfortably on bamboo boat rowed by the locals.  09:00 Check out the cabins, at your leisure while our cruise taking you pass by other beautiful highlights in the bay.  10:00 You will join with our short class of Cooking demonstration, how to make spring rolls before an early lunch is served.  12:00 Return to the shore and disembark from the cruise as our crew say farewell. Transfer to minibus or private and return to Hanoi. Arrival back at your hotel approximately 16:30 – 17:00.  Overnight in Ha Noi"},{"title":"Day 4 HA NOI CITY TOUR - DA NANG ARRIVAL BY TRAIN","description":"Meal included: Breakfast, Lunch. In the morning: 07:30 - 08:30: Our bus & tour guide will pick you up at the hotel in Ha Noi old quarter depart to Hanoi city tour full day. 09:00: Visiting first place named Tran Quoc pagoda on the West Lake the oldest pagoda in Vietnam. 09:30: Visit the Ho Chi Minh Mausoleum and Museum to explore the architectural and historical aspects of Uncle Ho’s final resting-place. Just next door is Ho Chi Minh’s house on stilts and lying to one side of the Mausoleum is the One-Pillar Pagoda which was founded by King Ly Thai To in 1049 - the structure has become an important symbol for the people of Hanoi.  11:00: Visit the Bat Trang  Pottery Village In the afternoon: 13:00: Bus takes you to a local restaurant in Hanoi Old Quarter, have a rest and enjoy the lunch. 14:00:  Visit Temple of Literature, the most famous temple situated in Hanoi, also functioned as Vietnam's first university. It was first constructed in 1070 under King Ly Nhan Tong and dedicated to Confucius, sages and scholars. A vast structure that has existed to present day. 15:30: Drive to legendary Hoan Kiem Lake, visit Ngoc Son Temple dedicated to Van Xuong saint and former general commander Tran Hung Dao for his struggle against Mongolians. You also see the beautiful Vietnamese and French architecture around the lake. 16:00: Arrive back to your hotel. Tour ends ! Notes: •\tHo Chi Minh Mausoleum Ethnology Museum and  close on Monday and Friday morning. •\tThe itinerary can be changed due to weather, tide levels and operating conditions.  Free time in the afternoon until 06:30PM 06:30PM: Private car pick up to train station, take train to Da Nang. Overnight on train - soft sleeper, air condition, 4 berth/cabin."},{"title":"Day 5 DA NANG ARRIVAL – HOI AN ANCIENT TOWN","description":"In and around Hoi An, Ho Chi Minh CityMeal not included. 12:00PM: Arrival Da Nang train station, transfer to Hoi An Town Afternoon: You are free to discover the ancient town: Japanese Bridge, lantern road, traditional tailor shop, enjoy the specialities. Besides, you can view sunset at Cua Dai beach. Spend overnight in Hoi An."},{"title":"Day 6 MY SON HOLLYLAND – TRADITIONAL VILLAGE","description":"Meal included: Breakfast, Lunch 8.00 – 8.30: our guide pick you up at your hotel and depart to My Son holy land - the world cultural heritage.  10.00: Arrive at My Son and we'll have 2 hours to discover the site by walking throughout the landscape, learning histories with our local English speaking guide, enjoying the Champa's traditional performances. 11.30: Get back to mini van and move to a local house to learn how to make ricepaper, you will enjoy your own hand-making product later on! 12.00: Back to  the van and have lunch at another local house. relax with cold herbal tea,  nice foods and fresh air. 13.30:  take a boat trip to Hoi An with nice and cool breeze on boarding, beautiful river scenery on the biggest river in the Central of vietnam named as Thu Bon River. 14.30: arrive at Hoi An, we will drop you at your hotel. Tour ends! Overnight in Hoi An."},{"title":"Day 7 HOI AN – DA NANG – HO CHI MINH CITY ARRIVAL","description":"Meal included: Breakfast. After breakfast, you are free until airport transfer. You take a flight to Sai Gon. On arrival Ho Chi Minh City, we will see at the airport and transfer to center for checking in hotel. You are free time for leisure. Spend overnight in Sai Gon."},{"title":"Day 8 MEKONG DELTA (MY THO & BEN TRE)","description":"Meal included: Breakfast, Lunch 8.00am depart to My Tho city, 1.5 hours drive. • A smooth pass the rice fields to the beautiful rural. Start boat on the Tien River to islet. View the Dragon, Phoenix and Unicorn Islet. Walk into the village, visit fruit garden, enjoy the tropical fruit while folk music is performed by the local people. • The cruise will lead to Ben Tre province, “the country of coconut”, visit coconut candy workshop, bee house, enjoy honey tea and take a picture with snake. • The amazing rowing boat trip on the small canal – fully covered by the shadow of the water coconut’s tree. • Having lunch at local restaurant. After lunch, we will freetime for biking, walking. • 3.00 Back Saigon. On the way, we will stop at vinh Trang Pagoda. 5pm get back to Saigon. Stay overnight in Ho Chi Minh"},{"title":"Day 9 CU CHI TUNNEL 1/2 DAY","description":"In and around Cu Chi TunnelsMeal included: Breakfast. 08:30 We depart from Ho Chi Minh City to Cu Chi Tunnels for 60km from Ho Chi Minh City. Cu Chi is now considered a heroic district for its role in the anti – American war in Vietnam. It is legendary for its tunnels system of over 220 km and is a popular spot for both Vietnamese and foreigner. The peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers along the side of road. You will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, when Cu Chi was “A Free Target Zone “. The remnants you will see that Cu Chi still has her evidence to prove the fierce battleground that took place there. Ever wonder what it feels like to fire an AK-47? Visit Cu chi tunnels, you have a chance to find out! 14:30 The bus back HCM. Spend overnight in Ho Chi Minh."},{"title":"Day 10 HO CHI MINH DEPARTURE","description":"Meal included: Breakfast After having breakfast at hotel, you have relaxing time in Ho Chi Minh city until transfer to the airport for the flight back home. See you again!"}]},"error":{"errors":{"name":{"properties":{"message":"A tour name must have less than or equal to 80 characters","type":"maxlength","maxlength":80,"path":"name","value":"Vietnam - North to South 10 days (incl. 1 free data sim card + entry to the Artinus 3D Art museum)"},"kind":"maxlength","path":"name","value":"Vietnam - North to South 10 days (incl. 1 free data sim card + entry to the Artinus 3D Art museum)"}},"_message":"Tour validation failed","message":"Tour validation failed: name: A tour name must have less than or equal to 80 characters"}},{"tour":{"name":"10-Day Relaxing from Ho Chi Minh city to Hanoi with Phu Quoc island & Halong Bay (FREE 1 DATA SIM CARD)","duration":10,"travelStyle":["Adventure","Private","Group","Fully Guided","Discovery","Christmas & New Year"],"oldPrice":868,"price":694,"summary":"Guaranteed to depart! This tour is guaranteed to depart, so even if you're the only passenger confirmed, your tour will still go ahead as planned!","highlights":["Explore Ho Chi Minh City","Visit the Unicorn Island in Vietnam","Experience the local wine in Dinh Cau Temple"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/100045_7a0513.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/100045_7a0513.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_72359cc8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_f05a366c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_ef00d434.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_37d91ed8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_4223ce85.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_8fa6642c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_52a893c0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_d0f675ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_b8b1267f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_08516ee7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_e26b993f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_e274ebed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_c185ea5a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_bb8f029d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_d63ccee4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_d21e12bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_543f1058.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_48861994.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_1bed04aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_f0cc72ff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_2ae929b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_7b2eed1a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_bf9a4a77.jpg"],"destinations":["Ho Chi Minh City","Cu Chi Tunnels","Can Tho","Phu Quoc Island","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1 HO CHI MINH CITY ARRIVAL","description":"In and around Ho Chi Minh CityMeal not included On arrival Ho Chi Minh City, our car pick you up at the airport and drive to Ho Chi Minh city center. You have free time for leisure. Spend overnight in Ho Chi Minh city.Start point\n Your hotel located , Hồ Chí Minh, Vietnam "},{"title":"Day 2 CU CHI TUNNELS AND HO CHI MINH CITY TOUR","description":"In and around Cu Chi TunnelsMeal included: Breakfast, Lunch. 08:30 We depart to visit Independence Palace, also known at the Reunification palace, was built on the sight of the former Norodom palace. The Independence palace is a widely known landmark of Ho Chi Minh City and was designed by the architect Ngo Viet Thu. It was the sight of the end of the Vietnam/American war in 1975, as a North Vietnamese army tank crashed through the gates. The tank is still located at the Independence Palaces’ property. Continue seeing the beautiful structures from the French Colonial times such as the Notre Dame Cathedral, the historic Central Post Office. Followed by the remarkable site of the War Remnants Museum the museum has a vast display of the both the Indochina wars. In courtyard massive military vehicles are for exhibition as well as tiger cages for the visitor to get a feel on how it was to be a prisoner during wartimes. In the museum building itself, each floor will represent a separate theme from the war and the war crimes committed towards the Vietnamese people. We drive from Ho Chi Minh City to Cu Chi Tunnels for 60km from Ho Chi Minh City. Cu Chi is now considered a heroic district for its role in the anti – American war in Vietnam. It is legendary for its tunnels system of over 220 km and is a popular spot for both Vietnamese and foreigner. The peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers along the side of road. You will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, when Cu Chi was “A Free Target Zone “. The remnants you will see that Cu Chi still has her evidence to prove the fierce battleground that took place there. Ever wonder what it feels like to fire an AK-47? Visit Cu chi tunnels, you have a chance to find out! Spend overnight in Ho Chi Minh city. "},{"title":"Day 3 MEKONG DELTA (MY THO – BEN TRE)","description":"Meal included: Breakfast, Lunch. Departure 7:45 AM An unforgettable way of seeing the Mekong Delta to drive along the provincial roads down on the Southern region of Vietnam through paddy rice field, pine-apple plantation, orchard and small hamlets (2 hours drive) After arrival in My Tho, you will ride on a local motor boat along Dragon Island, Unicorn Island, Phoenix Island, Turtle Island and stop at the famous Unicorn Island. While at the Unicorn Island, you will take a short trek and go for a rowing boat trip. You will also enjoy tropical fruits in an orchard, natural pure honey at a bee farm and traditional music. From there, you will continue your motor boat trip to Ben Tre province to visit Mekong people handmade coconut candy. Then change to a small motor boat and travel along the lush, green canals, and stop at Mien Tay restaurant to enjoy Vietnamese lunch and bicycle riding around the village. 03:00PM transfer by bus to Can Tho city. Spend overnight in Can Tho."},{"title":"Day 4 CAN THO – CAI RANG FLOATING MARKET","description":"Meal included: Breakfast 7:00 AM After breakfast, take the morning boat trip to visit the Phong Dien floating market which is at its busiest at this time of day. Keep cruising through the small channels system and visit a rice noodle making village. Experience the “Monkey Bridge” in the Delta. Visit a second floating market (Cai Rang). Break for lunch.  2:00 pm Bus will drive you to Rach Gia. 05:00pm Arrive in Rach Gia, you are free to enjoy the peaceful landscapes in Rach Gia. Spend overnight in Rach Gia.7:00 AM After breakfast, take the morning boat trip to visit the largest floating market in Can Tho (Cai Rang) which is at its busiest at this time of day. Keep cruising through the small channels system and visit a rice noodle making village. Experience the “Monkey Bridge” in the Delta. Walk through the fruits garden, see the process of noodles making. Break for lunch. Return to Ho Chi Minh City. 2:00 pm   Change to public bus will drive you to Rach Gia city. 05:00pm   Arrive in Rach Gia bus station, transfer to the hotel, you are free to enjoy the peaceful landscapes in Rach Gia. Spend overnight in Rach Gia."},{"title":"Day 5 HYDROFOIL FROM RACH GIA TO PHU QUOC ISLAND","description":"Meal included: Breakfast, Lunch, Dinner 8:00am Hydrofoil from Rach Gia ferry to Phu Quoc island. 10:30am Arrived to Phu Quoc ferry, transfer by van to hotel, check in. 12:30 Have lunch at local restaurant, check in 14:30 Star for Eastern island: -Pepper garden, be captivated by word of “itsy-bitsy teeny weeny peppercorns” of patient growers -Ham Ninh ancient village, enjoy fresh seafood (personal charge) -Tranh Stream: waterfall is beautiful in Phú Quốc. -Hung Long/ Phap Quang Pogoda located on high hill, overlook to town -Back to Duong Dong town, stop at a Sim wine distillery, taste the local wine -Dinh Cau Temple, the savior of local fishermen -Have dinner at local restarant Back to hotel. Spend overnight in Phu Quoc."},{"title":"Day 6 SAO BEACH OR SNORKELING TOUR","description":"Meal included: Breakfast, Lunch, Dinner After breakfast, start to explore: Option 1: Excursion tour 8g00: transfer to the South of island and visit: -Fish sauce workshop: learn about the fish sauce production and enjoy the unique aromatic flavor of Phu Quoc fish sauce -Have lunch -Pearl Farm. You may be able to witness how oyster shells are cut open to retrieve pearls and how these pearls are bored, strung or placed on silver or gold ornaments. -Coconut prision: which was built in 1949-1950 by the French colonists to jail those considered specially dangerous to the colonist government -Sao beach – one of the most beautiful beach in the South East of Phuquoc island. Relax and swimming, have lunch here -Have dinner at local restarant Option 2: Snorkeling tour 8g00: transfer to the South of island and visit: -Pearl Farm. You may be able to witness how oyster shells are cut open to retrieve pearls and how these pearls are bored, strung or placed on silver or gold ornaments. -Then, go to pier, get on board for snorkeling and fishing. The snorkeling set is ready for you to enjoy the colorful life of coral reef and of the fish under water. Have lunch on board -Go back to pier and transfer to Sao beach – one of the most beautiful beach in the South East of Phuquoc island -Back to hotel -Have dinner at local restarant. Spend overnight in Phu Quoc."},{"title":"Day 7 PHU QUOC - HANOI","description":"In and around HanoiMeal included: Breakfast Have breakfast at hotel, free at leisure, check out and then transfer to Phu Quoc airport. Take a flight to Ha Noi.  Arrive in Hanoi, our driver will pick you up at airport to hotel. After checking hotel, you have more freedom to sightseeing fantastic landscape nearby. Some places recommend is visit Ho Chi Minh Mausoleum and Museum, One Pillar Pagoda, Ethnology museum, Military Museum or Fine Art museum, Hoan Kiem lake, Ho Tay,... Spend overnight in Ha Noi."},{"title":"Day 8 HANOI - HA LONG BAY","description":"Meal included: Breakfast, Lunch, Dinner (Your hotel – Tuan Chau marina – Halong bay – Lunch– Surprising Cave – Titop Island – Sunset party – Dinner – Onboard night activities) 07.45 – 08.15 approx – Our guide will meet you at your hotel. The shuttle bus or private car pick up – Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta – Get your camera ready to take photos. Comfort break. The time from Hanoi to Halong bay is approximately 3 ½ hours.  12 – 12.30 approx – Arriving Tuan Chau marina. Welcome aboard the cruise. Refresh with our welcome drink. Meet the captain, crew in the cruise briefing. – Check into your cabin. Time to refresh and unwind – Set sail as lunch is served – Join us for a typical local lunch in the dining room or at the outdoor dining area.  Afternoon – Arrive at Surprising Cave (Hang Sửng Sốt), explore the cave and find out how the cave was named a Surprising. – Heading to Titop island area. Drop anchor in the calm water surrounded by beautiful islets. Visit Titop island for swimming and snorkeling or do the short trek to the top of island to have the overview of Halong bay from here – Heading back toward the sleeping area  Early evening – Summit on the sundeck watching the sunset, enjoy Sunset party. It’s ideal time to make acquaintance with new friends, sharing your traveling experience or simply watching the sunset – An authentic Vietnamese menu is served – After dinner, reward yourself with a large selection of cocktails at our bar, or take for you one of our onboard activities: book reading, games, movies, and squid fishing…"},{"title":"Day 9 HALONG BAY– HANOI","description":"Meal included: Breakfast, Lunch. (Tai Chi – Breakfast – Luon Cave – Cooking Demonstration – Lunch – Farewell at your hotel) 06:30 For the early risers join us for a Tai Chi session on the sundeck. Tai chi helps focus the mind and condition the body, joining Tai Chi session to full charge your energy for the day.  07:00 – 08:00 Local breakfast is served  08:00 – Mingling yourself in the stunning views of the Bay and it’s dramatic limestone islets as we sail through the calm emerald waters heading to Luon Cave (Hang Luồn) – Take your option either exploring the cave yourself on kayak or comfortably on bamboo boat rowed by the locals.  09:00 Check out the cabins, at your leisure while our cruise taking you pass by other beautiful highlights in the bay.  10:00 You will join with our short class of Cooking demonstration, how to make spring rolls before an early lunch is served.  12:00 Return to the shore and disembark from the cruise as our crew say farewell. Transfer to minibus or private and return to Hanoi. Arrival back at your hotel approximately 16:30.  Stay overnight in Ha Noi."},{"title":"Day 10 HA NOI DEPARTURE","description":"  Meal included: Breakfast   Breakfast at hotel, free time for leisure. Our car transfer you from hotel to the airport, take the flight back home. See you again."}]},"error":{"errors":{"name":{"properties":{"message":"A tour name must have less than or equal to 80 characters","type":"maxlength","maxlength":80,"path":"name","value":"10-Day Relaxing from Ho Chi Minh city to Hanoi with Phu Quoc island & Halong Bay (FREE 1 DATA SIM CARD)"},"kind":"maxlength","path":"name","value":"10-Day Relaxing from Ho Chi Minh city to Hanoi with Phu Quoc island & Halong Bay (FREE 1 DATA SIM CARD)"}},"_message":"Tour validation failed","message":"Tour validation failed: name: A tour name must have less than or equal to 80 characters"}},{"tour":{"name":"Budget Vietnam Family Holiday from Hanoi to Halong Bay, Da Nang, Hoi An, Saigon and Mekong Delta","duration":10,"travelStyle":["Family","Christmas & New Year"],"oldPrice":0,"price":1134,"summary":"This 10-day tour definitely amazes you with the unforgettable discovery of magnificent Hanoi, breathtaking Halong Bay by cruise, Hoi An Ancient Town, mysterious My Son Sanctuary, bustling Saigon, and unique Cai Be Floating Market in Lower Mekong Delta province of Vinh Long.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/171057_3c4cd5d7.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/171057_3c4cd5d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_a3ed6870.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_42bb7339.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_094ec9ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_d9ef09d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_10e60a0e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_2c417434.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_fc4c5886.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_3e6fce9b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_f1ebfa6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_5f5ddd1e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_383e501e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_a96445a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_cf8262db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_8144b44d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_d42eea53.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_87281cf9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_2f5d8651.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_e170418a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_52762d10.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_b07508bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_7ca720ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_9f6dcdd9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_e642f629.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Mekong Delta","Cu Chi Tunnels"],"timeline":[{"title":"DAY 1 – ARRIVAL – HANOI","description":"In and around Hanoi, Da NangUpon arrival at Noibai Airport, you’ll be met by our tour guide & transferred to your hotel in Hanoi for a Check-in. The rest of time, you’ll be free on your own. O/N in Hanoi.Start point\n Your hotel, Hanoi, Vietnam 08:00"},{"title":"DAY 2 – HANOI – HA LONG (GROUP TOUR) (B/L/D)","description":"07:30  Our shuttle bus with tour guide will pick you up at your hotels (Note: This pick-up is just applied for those who use our shuttle bus service) 10:30  Stopover in Hai Duong City where you can experience our hand-made Vietnamese handicraft products. 12:30  Arrive in Tuan Chau Marina Pier (Tuan Chau Island). Followed by activities such as:  boarding Luxury Flamingo Cruise for departure, Welcome drink will be served and cruise briefing, safety instructions, check-in cabins by Cruise Manager 13:30  Great lunch is served while cruising passing by islets. 15:00  Kayaking around Pearl Farm Village, visit Titop Island. Free choice of activities such as sunbathing, swimming and conquering the peak of the biggest island in Halong and taking panoramic photos of Halong bay in the afternoon. 17:30    Happy Hour. Buy 2 beverage get 1 for free 18.00    Cooking Class. Our Chef will demonstrate the preparation of a particular Vietnamese cuisine in the dining room. Our guide will let you know what item will be prepared and will explain the process during the demonstration. Duration about 20 – 30 minutes 18:30    Enjoy Sunset Party with fruits and tea 19:30    Under the magnificent night sky, our luxury set menu dinner is served with variety of Vietnamese and Asian foods 21:00    Joining the squid fishing on boat with our crews and can enjoy the squid cooked with assistance from our chef or laze yourself with our happy-hour drinks at the bar Overnight on Luxury Flamingo Cruises."},{"title":"DAY 3 – HA LONG – HANOI (B/L)","description":"06:15     Tai Chi class on the Sun-Deck 07:15    Have light breakfast with Coffee, tea, and bakeries on board 07:45    Arrive at the Surprising cave, the biggest cave in Ha Long Bay with 10,000 square meters, when you visit the cave like our Vietnamese house with three chambers as lobby, dining room and bedroom with most beautiful stalagmites and stalactites. We will tour the cave for about 60 minutes. 09:00  Upon return to the boat you will have time to freshen up and finish packing. When checking out please remove all of your belongings from the cabins, you may leave heavy luggage outside of the cabins. 10:00    Relaxing on the sundeck or in the dining room enjoying the bay scenery as we approach the pier 10.45    Brunch is served. After brunch, Relax on the sundeck or in the dining room enjoying the bay scenery as we approach the pier. 11:45   Disembark at Marina coffee – Gate 26 in Tuan Chau New Marina. O/N in Hanoi."},{"title":"DAY 4 – HANOI – FREE DAY – NIGHT TRAIN TO DA NANG (B)","description":"Today you will have leisure time for shopping or discover Hanoi by yourself (No Guide – No Car). By the end of day at around 18:30, we’ll be transferred to the Hanoi Railway Station for a night train to Da Nang on SE1 (19:30 – 11:40 +). Overnight on the train."},{"title":"DAY 5 – DA NANG RAILWAY STATION – HOI AN – FREE (B)","description":"In and around Hoi An, Ho Chi Minh CityUpon getting to the Da Nang Railway Station, you’ll be welcome & escorted to your hotel in Hoi An for a check-in. The rest of time, you’ll be free on your own. O/N in Hoi An."},{"title":"DAY 6 – HOI AN – GROUP TOUR TO MY SON SANCTUARY – BOAT TRIP ON THU BON RIVER (B)","description":"08:00 – 08:30 AM: Our guide picks you up at hotel and leave Hoi An for visiting My Son Holly Land – the ruins of Cham people and was an imperial city during Cham dynasty. Here you can have more chance to explore and understand of technique of Old Cham people in making red bricks to build Tower which still now a secret to everyone, you can see a large complex of religious relics that comprises more than 65 architectural works. It also surprises for those who are curious with architectural art. In 1999, UNESCO labeled the Cham architecture in My Son as a World Cultural Heritage Site. Moreover, you have chance to enjoy traditional music performed by Cham girls in their colorful uniforms. Then transferring you back about 30km, you will take a boat trip along the Thu Bon River  to Hoi An Ancient Town. After that, back to the pier and come back your hotel by your own way & end of tour. O/N in Hoi An."},{"title":"DAY 7 – HOI AN – DA NANG – FLIGHT TO SAIGON (NOT INCLUDED) (B)","description":"After having breakfast, you’ll be at leisure till the time of a transfer to the Da Nang airport for a departure flight to Saigon on VN117 (15:30 – 16:50). Upon arrival at Tan Son Nhat Airport, you’ll be met by our tour guide & transferred to your hotel for a Check-in. The rest of time, you’ll be free on your own. O/N in Ho Chi Minh City."},{"title":"DAY 8 – SAIGON GROUP TOUR TO MEKONG DELTA (B/L)","description":"PICK UP: 7:30am – 8:15am  RETURN: 17:30pm  ROUTE: HCMC – My Tho - Ben Tre – HCMC. Highlight: A trip to Mekong Delta to immerse yourself in the natural beauty and the rich culture of the vibrant southern Delta region. Boating down the river to experience the local life, fishing port, fishing floating house, enjoy the local folk song music and seasonal fresh fruit. Itinerary: Leaving the hustle and bustle of Ho Chi Minh City and start your trip to depart for My Tho, the town lies on the left side of the Mekong River. Boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands.Stop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Visit the fruit plantation. Riding a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family business, visit honey-bee farm, enjoy honey tea and coconut candy workshop. Have lunch at local restaurant. Break time. In the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t join the cycling trip. Return to Ho Chi Minh City.  O/N in Ho Chi Minh City."},{"title":"DAY 9 – SAIGON GROUP TOUR TO CU CHI TUNNELS (B/L)","description":"In and around Cu Chi TunnelsAfter having breakfast at hotel, you’ll be at leisure at the lobby of hotel At around 09:00, you’ll be picked up at your hotel then transferred about 30km north-west of Ho Chi Minh City to Cu Chi town. Cu Chi tunnels were used as the base from which the Vietnamese mounted their operations of the Tet Offensive in 1968. The incredible underground network in Cu Chi stretched over 200 kilometres and became legendary during the American war. The extensive tunnels have been specially constructed with living areas, weapon factories, filed hospitals, command centres, plus accommodation. Today we have an excursion to Cu Chi Tunnels to visit an exposition hall and a widened section of the tunnels to get a feel of the underground life. There are also possibilities to fire off rounds from an AK47 or MK16 at the nearby rifle range. At around 15:00, you’ll get back to your hotel & have a free time to relax by yourself. O/N in Ho Chi Minh City."},{"title":"DAY 10 – SAIGON – DEPARTURE (B)","description":"After having breakfast, you’ll be at leisure till the time of a transfer to Tan Son Nhat airport for a departure flight. (Note: The check-out time at hotel is prior to 12:00)."}]},"error":{"errors":{"name":{"properties":{"message":"A tour name must have less than or equal to 80 characters","type":"maxlength","maxlength":80,"path":"name","value":"Budget Vietnam Family Holiday from Hanoi to Halong Bay, Da Nang, Hoi An, Saigon and Mekong Delta"},"kind":"maxlength","path":"name","value":"Budget Vietnam Family Holiday from Hanoi to Halong Bay, Da Nang, Hoi An, Saigon and Mekong Delta"}},"_message":"Tour validation failed","message":"Tour validation failed: name: A tour name must have less than or equal to 80 characters"}},{"tour":{"name":"Short Northern Vietnam packages 6Days/5nights","duration":6,"travelStyle":["Adventure","Family","Christmas & New Year"],"oldPrice":0,"price":585,"summary":"\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/128179_ff337029.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/128179_ff337029.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128179_54040105.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128179_270bbbb6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128179_ae16d885.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128179_b7818dc5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128179_47413246.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128179_096bda65.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128179_d4f64ff2.jpg"],"destinations":["Hanoi","Lao Cai","Sapa","Lao Chai","Cat Cat Village","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi Arrival – Night train to Sapa (No Meal)","description":"In and around HanoiYou will be greeted at the airport and transferred to down town. Hanoi, a city of lakes, shaded boulevards and verdant public parks – the capital of Vietnam. The rest of day is yours.    In the evening: Bus and guide will pick up again then transfer to Railway Station to catch night train to Sapa. Overnight on the train."},{"title":"Day 2: Lao Cai –Lao Chai –Tavan Village (B/L/D)","description":"5:30 – 6:30: Pick up at Lao Cai train station by our staffs then drive to Sa Pa by bus.   7:00 -8:00: Have breakfast and relax at hotel. If hotel has avaiable room, you can check in early, if not, you join in tour first.   9:00 – 9:30: Our guide takes you to visit two villages of the H’mong and Dzay People, called Lao Chai, Ta Van village. Have lunch on the way or in a family of the ethnic people. (You will start trekking from hotel to the Lao Chai village with the distance about: 12 kms.   17:00 When you finish the trekking trip at the end of the village, our bus will pick up you back to Sapa town.   Dinner and Overnight in hotel.Overnight in Sapa."},{"title":"Day 3: Sapa- Cat Cat village- Sin Chai - Ha Noi (Meals: B/L/D)","description":"7:00 Have breakfast.   9:00 – 9:30 Our guide takes you to visit a village of Black H’mong people.It is named Cat Cat Village, you have a chance to visit a waterfall and the hydroelectric power station built by the French ( This activity take 2 hours walking up and down to the valley ).    12:30 -13:00:Back to SaPa town and have lunch.You are free and easy to discover Sapa town.   16:30 – 17:00: Transfer from hotel to Lao Cai train station. Have dinner at the restaurant, near the train station before getting on the night train to go back to Ha Noi.    Overnight on the train."},{"title":"Day 4: Hanoi – Halong Bay (B/L/D) – Golden Star Cruise","description":"07:30 - 08:30 Tour guide and shuter bus will pickup you at the hotel in Ha Noi old quarter and Hanoi Opera House then depart to Halong. On the half way stop for short break about 20 minutes.   12:30 Arrive Ha Long International Port, then tranfering to Golden Star Cruise by small boat. Enjoy welcome drinks, crew briefing before checking in cabin. Start cruising and enjoy a special lunch with Vietnamese traditional dishes while the boat slowly slides on romantic    15:30 Visiting Sung Sot Cave (surprising cave)   16:30 Our cruise will take you to the Titov Island, it is noted for having a viewpoint at its peak which affords splendid views all around Halong bay. Or you can enjoy your swimming on romance sandy beach.   17:30 Enjoy the Sunset party with wine and fruit and relaxing on sun deck    18:00 Cooking class how to make fresh noodle roll, you can enjoy product which you make it.   19:00 Enjoy your dinner in restaurant in middle romantic quite bay.   20:00 Playing some sports games like: Football table, Darts, Fishing, karaoke, dancing…"},{"title":"Day 5: Halong Bay – Hanoi (B/L)","description":"06:30 Wake up early to see the sunrise on Ha Long Bay then have breakfast with tea and coffee free   08:00 The boat cruising to Pearl farm. The pearls in Halong are the most renowned in Vietnam. The process of farming and retrieving pearls takes years.    09:00 Enjoy kayaking discover Halong bay. Then back to Cruise check out, take time to relax    11:00 Have lunch while the boat is cruising back to Tuan Chau International Port,    12:30 Get on the bus back to Hanoi, on the half way stop for short break 25 minutes   16:30 - 17:00 Arrive at the hotel in Ha Noi old quarter and Hanoi Opera House.   Overnight in Hanoi"},{"title":"Day 6: Hanoi - Departure (B/L)","description":"Breakfast at hotel. Free time to explore Hanoi by yourself until driver take you directly to the airport .   End of trip!"}]},"error":{"errors":{"summary":{"properties":{"message":"A tour must have a summary","type":"required","path":"summary","value":""},"kind":"required","path":"summary","value":""}},"_message":"Tour validation failed","message":"Tour validation failed: summary: A tour must have a summary"}},{"tour":{"name":"DREAMING Vietnam Offroad Motorcycle Tour to Ha Giang via Dong Van, Meo Vac and Ba Be Lake","duration":5,"travelStyle":["Motorcycle Ride","Christmas & New Year"],"oldPrice":0,"price":699,"summary":"We make this motorbike tour for experienced riders, whose love to explore this beautiful destination even you don’t have weeks to ride along. Besides the beautiful scenery that we enjoy on the tour itinerary, you also experience and explore the lives of ethnic minorities as home-stay with them. In addition, we also have the opportunity to Ba Be National Park to explore the wild beauty of nature here…","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceee8c918.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceee8c918.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceeeb22fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceeeba437.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceeec4b45.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceeed7a65.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceeede44c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceeee83d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceeef2ab0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceef2659c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceef2f364.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceef37dd4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceef43a6b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceef5c6b5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceef740bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e017ae854937.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e017ae85b43b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e017ae85fbd3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e017ae86461e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e017ae868f04.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e017ae86dc6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e017ae872b32.jpg"],"destinations":[],"timeline":[{"title":"Day 1: HANOI MOTORCYCLE TOURS TO VU LINH VILLAGE (THAC BA LAKE, YEN BAI)","description":"In and around HanoiWe start our Motorbike tour by riding on to dyke roads following Red river to Thac Ba lake. See beautiful countryside, rice and green tea fields. Then we turn to the little road to Vu Linh village, where populated by Dzao ethnic minority by the side of Thac Ba lake, very friendly people and the welcome is exceptional. Home-stay in Vu Linh  Summary: Distance:  180 km Meals: Lunch, Dinner Accommodation: Home-stay"},{"title":"Day 2: THAC BA MOTORCYCLE TOURS TO HA GIANG CITY","description":"After breakfast, we motorcycle along the Thac Ba lake on a small road lined by palm trees and scenic mountain views to join the main Road 2, heading up to Ha Giang where we stop for the night and apply for a permit.  Summary: Distance:  180 km Meals: Breakfast, Lunch, Dinner Accommodation: Hotel"},{"title":"Day 3: HA GIANG MOTORCYCLE TOURS TO DONG VAN (HA GIANG) – OFFROAD MOTORBIKE TOURS TO TRIBAL VILLAGES","description":"After getting the permit to ride in border areas at Ha Giang’s Immigration Police, we motorbike on small challenging mountain roads (but incredibly beautiful) on the land of colorful mountain hill-tribes. Head up the Ma Pi Leng Pass. Here is yet another amazing place, with cloudy mountain ranges and the poetic Nho Que river winding off in the distance.  It is really difficult to find the exact words to describe Ma Pi Leng Pass, located between Dong Van and Meo Vac, near the northernmost tip of Vietnam, as a painting of astonishing beauty and magnificence that captures the eyes of all viewers and nature lovers.  Ride on a zig-zag track until reaching Vuong Family’s Residence, 14 kms before Dong Van. Vuong Family was considered the King of the Hmong People in Dong Van, Ha Giang. Their residence was built in the scenic valley of Sa Phin with Chinese architecture. The whole house was built out of wood and rock only. The rocks for the buildings were imported from China. Vuong Family Residence is a masterpiece of man work in the valley of heavenly beauty of Sa Phin.  This is a remote area and we can meet the hard-working local people here. It is inspiring to see how they survive as they manage live in the rocks.When we reach Dong Van Town we will have some extra time to wonder the ancient streets lined with H’mong homes of clay bricks and tiles roofs built centuries ago.  Summary: Distance:  160 km Meals: Breakfast, Lunch, Dinner Accommodation: Hotel"},{"title":"Day 4: DONG VAN MOTORCYCLE TOURS TO BA BE NATIONAL PARK (BAC KAN) VIA MEO VAC","description":" The road is still under construction and tracks what make the ride relatively long in spite of few kilometres. The landscape is among the most beautiful of Vietnam, and the slow tempo is only more appreciable.  We cross the wild regions of the mythical province of Ha Giang, Meo Vac is included. It shares the border with Dong Van District of Ha Giang Province and Bao Lam District of Cao Bang Province. Meo Vac has most of the terrain in the Rock Plateau of Dong Van and above 1000m above sea level.  Meo Vac has a harsh climate in the winter which is from November to April with dry and freezing cold weather. It is inhabited by different ethnic minorities including the H’mong, the King, Tay, Dzao…Most ethnic groups have maintained their culture untouched from the outside world. Beautiful motor ride down to Bac Kan Province in the afternoon. Take a local boat-ride on the reservoir of Na Hang Hydro Power Factory to village near by Dau Dang waterfall in Ba Be National Park for home-stay.  Summary: Distance:  160 km Meals: Breakfast, Lunch, Dinner Accommodation: Home-stay"},{"title":"Day 5: BA BE MOTORCYCLE TOURS TO HANOI","description":"Note: This is a very big day, we should start early and ride back carefully on Road 3 .After breakfast, take an other boat-ride on Ba Be lake to other side, before jumping on our motorbikes to Cho Ra, head up to main Road 3. Ba Be National Park is an abundant bioreserve area containing the world’s only fresh-water karst lake and several rare species of fauna and flora. Ba Be lake in VietnamThe biodiverse 10,048 ha park – home to 1,268 species of flora and fauna, a series of caves and a gigantic fresh water lake – was established in 1992 by the Vietnamese Government to preserve forest ecosystems in the northeast. Ba Be is home to over 3,000 people from the ethnic minorities of Tay, Nung, Dao and Mong, who live in 13 villages =within the park. The Tay people have inhabited Ba Be  area for centuries and make up 58 per cent of the population within the park’s boundaries. On Road 3, the way back to Hanoi, traffic is getting worst and worst, so we should be back before rush hour.  Summary: Distance:  230 km Meals: Breakfast, Lunch  "}]},"error":{"errors":{"name":{"properties":{"message":"A tour name must have less than or equal to 80 characters","type":"maxlength","maxlength":80,"path":"name","value":"DREAMING Vietnam Offroad Motorcycle Tour to Ha Giang via Dong Van, Meo Vac and Ba Be Lake"},"kind":"maxlength","path":"name","value":"DREAMING Vietnam Offroad Motorcycle Tour to Ha Giang via Dong Van, Meo Vac and Ba Be Lake"}},"_message":"Tour validation failed","message":"Tour validation failed: name: A tour name must have less than or equal to 80 characters"}},{"tour":{"name":"Highlights of Vietnam Tour to Hanoi, Halong, Tam Hoc, Hoa Lu, Hue, Hoi An, Saigon","duration":11,"travelStyle":["In-depth Cultural","Christmas & New Year"],"oldPrice":0,"price":1749,"summary":"All highlights of Vietnam will be coverd in this tours, you will have the oppoturnity to explore Hanoi Capital where has had a rich history, the world natural heritage site, and Hoa Lu.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/170794_4ed1f68f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/170794_4ed1f68f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_a27d3413.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_6de23eec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_2713e3b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_7e0c7828.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_89f0e76d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_7f81b7aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_c1e924c2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_a6dc7f27.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_8d3e56ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_3e49ed68.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_b4bb4280.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_2adc9e13.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_d74ca064.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_7db65082.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_5f2fce04.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_44979ab5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_ea51413b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_1fe68e4f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_10346151.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_d32a1104.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_04d9e711.jpg"],"destinations":["Hanoi","Halong Bay","Tam Coc","Hue","Hoi An","Ho Chi Minh City","Cu Chi Tunnels","Mekong Delta"],"timeline":[{"title":"DAY 1. ARRIVAL – HANOI PACKAGE TOUR (-/-/-)","description":"In and around Hanoi, Da NangOn arrival at Noi Bai Airport, you are met by our guide and transferred to hotel. The capital of Vietnam, Hanoi is a stylish and gracious city that retains an unique old world charm and some Asia’s most striking colonial architecture. The many lakes and parks make for relaxing atmosphere. If time permits we enjoy a short cyclo ride through the bustling old quarter streets named after the specific goods once offered for sale at these places. O/N in Ha Noi.Start point\n Your hotel, Hanoi, Vietnam 08:00"},{"title":"DAY 2 - HALONG CRUISING TOUR (B/-/-)","description":"7:30 – 08:30: Our SHUTTLE BUS with tour guide will pick you up at your hotels (Note: This pick-up is just applied for those who use our shuttle bus service). 10h30: Stopover in Hai Duong city where you can experience our hand-made Vietnamese handicraft products. 12h30: Arrive in Tuan Chau Marina Pier (Tuan Chau Island). Followed by activities: + Boarding FLAMINGO CRUISEs for departure. + Welcome drink will be served and cruise briefing, safety instructions, check-in cabins by Cruise Manager. + Great lunch is served while cruising passing by islets, through Hoa Cuong floating village. + Exploration of Halong Bay passing by Soi Sim Beach, Coconut Three Island. Then arrive in the area of Surprising Cave. + Kayaking & swimming or climbing up to the mountain and getting a complete view of Halong Bay at Titov Beach + Joining our COOKING CLASS on the sun-deck. Let’s see how to make the fresh/fried spring rolls and mix fish-sauce. + Enjoy sunset party with fruits and wine. 19:30: Under the magnificent night sky, Our luxury set-menu dinner is served with a variety of Vietnamese and Asian foods. Evening activities include: + Join the SQUID FISHING on boat with our crews. You can enjoy the squid cooked with assistance from our chef. + Or Laze yourself with our happy-hour drinks at the bar. Overnight on Flamingo Cruise."},{"title":"DAY 3 - HALONG CRUISE TOUR – HANOI (B/L/-)","description":"06:15: Tai Chi class on the Sun-deck. 07:15: Have breakfast with Coffee, tea and Bakeries on board. 08:00: Visit the SURPRISING CAVE (Hang Sung Sot) discovered by the French in 1901. Opened for tourists since 1936, now it is a must-to-see and a symbol for geology value of Halong. 09:30: Check out time. Then relax on the sun-deck or inside the restaurant to enjoy the bay’s scenery. 10h15: Enjoying a traditional Vietnamese lunch while cruising back to the pier. 12:00: Disembarkation at Tuan Chau Pier. Our car will be at your disposal to pick you up then drive back to Hanoi. 16:00: Arrive in Hanoi. End of the trip! Overnight in Hanoi."},{"title":"DAY 4 – FULL DAY TOUR TO HOA LU & TAM COC IN GROUP (B/-/-)","description":"In and around Ho Chi Minh City The country capital during the Dinh and early Le Dynasties is Hoa Lu, which however has left its legacy in the form of two small temples, each one nearly a thousand years old. Today we will depart our hotel at 8h00 for Ninh Binh to visit these two remaining structures. The first one is dedicated to the Dinh Dynasty. The second one commemorates the Le Rulers. In front of these temples is the rugged Ma Yen mount; it involves a walk over 200 steps for a fantastic view over the surrounding areas. The following sight is Tam Coc which is surnamed “Halong Bay on land”. We board a sampan for a leisurely trip through the quiet and peaceful landscape of rice fields surrounded by towering limestone cliffs to the grottoes of Tam Coc. The trip ends after arrival in Ha Noi. O/N in Ha Noi."},{"title":"DAY 5 - HANOI – FLIGHT TO HUE (NOT INCLUDED) – HUE HALF- DAY SIGHTSEEING TOUR (B/-/-)","description":"In and around HueAfter breakfast at hotel, you will be transferred to Noi Bai airport for a morning flight to Hue on VN 1543 (8:30 – 09:45) Upon arrival, you will be escorted by our guide & driver then driven to your hotel for a drop of your luggage. Later on,  we have a boat trip on the romantically named Perfume River visits Hue’s best-known religious site, Thien Mu Pagoda. The beautiful riverside Thien Mu Pagoda is one of the oldest ancient architectural structures for religious work ship in Hue. We include this in a half day cruise on the Perfume River which also gives us a taste of the scenic countryside and an enjoyable visit to the mausoleum of Emperor Minh Mang in a tranquil setting of gardens and lakes. This impressive landmark reflects the beautiful architecture, intricate decor and mysterious statues. Afterwards, We start our sightseeing tour with the massive citadel named the Imperial Citadel where the Nguyen Dynasty ruled between 1802 and 1945 including Flag Tower, Noon Gate, Nine Dynastic Urns, Nine Holy Cannons, Thai Hoa Palace, and Forbidden Purple City. This royal residence was all but destroyed during the 1968 Tet Offensive, however it is still fascinating to walk among the ruins. Close to this masterpiece is Hue Imperial Museum which displays an interesting collections of bronzes, Chinaware, court robes and various emperors’ personal belongings. By the end of the day, we will have one more chance to take a glancing tour of Hue with a walk to the bustling Dong Ba Market that sells a wide variety of local goods and handicrafts. Along the way we pass many fantastic eating spots, all ideal for visitors to sample some local delicacies. O/N in Hue."},{"title":"DAY 6 - HUE PACKAGE TOURS – DANANG SIGHTSEEING TOURS (B/-/-)","description":"In this morning, before leaving to Danang we will take a short drive though the rolling hill to see the elaborate royal tomb of Emperor Tu Duc and the famous Tu Hieu Pagoda. The scenic 4-hour drive via Hai Van Pass offers spectacular views of mountains, the sea, idyllic beaches and villages (we can choose the shorter way by driving through the tunnel). Upon arrival Da Nang, we will take a visit to Cham Museum formerly known as the Ecole Francaise d’Extreme Orient. This museum contains many exquisite limestone carvings from the vanquished Kingdom of Champa which has been the central coastal littoral prior to the march of the Vietnamese nation southward. Then a visit to Marble Mountains with its beautiful grottoes and temples whose peaks represent the five elements of the universe. Later on, we keep on rolling further southward to Hoi An, which was originally one of major trading centers of Southeast Asia in the 16th century. O/N in Hoi An."},{"title":"DAY 7 - HOIAN SIGHTSEEING TOURS (B/-/-)","description":"In and around Hoi AnHoi An which was originally a Cham seaport but has been influenced down centuries by a myriad of traders from various cultures. There are plenty to see in this tranquil and delightful town, some of which are the famous Japanese Covered Bridges, the Pottery Museum, the 200 years old Tamky House, the Chua Ong Pagoda and the vibrant market. We include these sites in an enchanting walking tour past many low tiled houses scattered along the small streets and assembly halls which reflect the town’s multi-cultural past The rest of time, you will be free on your own. O/N in Hoi An."},{"title":"DAY 8 - HOIAN PACKAGE TOURS – DANANG – FLIGHT TO HO CHI MINH CITY (NOT INCLUDED) (B/-/-)","description":"After having breakfast at hotel, you will be transferred to Da Nang airport for a short morning flight to Ho Chi Minh on VN7131 (07:50 – 09:20) On arrival you are met by our guide and transferred to hotel. This metropolis, contradiction of its northern counterpart, is crowded with bikes and motorbikes, excited by numerous shopping areas and sidewalk cafes. An afternoon will acquaints us with some major sights of Ho Chi Minh. We drive past many lively streets on our way to the Reunification Palace. This mansion was the former residence of the President of South Vietnam until end of April 1975. Close to the palace are some striking French colonial structures including the Notre Dame Cathedral and the Old Sai Gon Post Office. We follow these with a visit to the Jade Emperor Pagoda and the War remnant exhibit. The final stop is Ben Thanh Market where anything and everything is for sale! O/N in Ho Chi Minh."},{"title":"DAY 9 – SAIGON SIGHTSEEING TOUR TO TAY NINH – CU CHI TUNNELS TOUR (B/-/-)","description":"In and around Cu Chi TunnelsThe incredible underground network in Cu Chi stretched over 200 kilometres and became legendary during the American war. The extensive tunnels have been specially constructed with living areas, weapon factories, filed hospitals, command centres, plus accommodation. Today we have an excursion to Cu Chi Tunnels to visit an exposition hall and a widened section of the tunnels to get a feel of the underground life. There are also possibilities to fire off rounds from an AK47 or MK16 at the nearby rifle range. Upon leaving Cu Chi we drive a short distance to Tay Ninh, the headquarters of Cao Dai Sect . This religion was founded in 1923 and now numbers over 2 million members. We arrive in time to see the ornate temple of Cao Dai and attend the fantastic mid-day service when the followers fill the hall wearing colored robes. These costumes are a symbol of the curious combination of the Confucianism, Taoism and Buddhism. O/N in Ho Chi Minh."},{"title":"DAY 10 - SAIGON – MEKONG DELTA PACKAGE TOUR (B/L/-)","description":"Heading out of town, we travel by roads to the Mekong Delta. This plain region boasts the largest rice bowl of Vietnam. On arrival in My Tho we board a boat navigating around the intricate small canals, which is a great way to observe the local lifestyle close-up and catch a view dotted by many islands. The exciting river trip will pass by the lush green vegetation towards the famous Unicorn Island where we have a chance to stroll around an orchard, taste many seasonal fruits and see farmers at work. We navigate some narrower canals using small rowing boats to Ben Tre Province for an interesting visit to some local industries. The extra enjoyment is a lunch at one of the famous local eating spots. We drive back to Ho Chi Minh, stopping off en route to see the beautiful Ving Trang Pagoda and the Saigon’s Chinatown, locally named Cho Lon. This bustling area is crammed with sacred temples and mysterious, narrow lanes. O/N in Ho Chi Minh."},{"title":"DAY 11. SAIGON – DEPARTURE (B/-/-)","description":"There is a free time to relax or further explore Ho Chi Minh. The tour ends after your transfer to Tan San Nhat Airport for departure."}]},"error":{"errors":{"name":{"properties":{"message":"A tour name must have less than or equal to 80 characters","type":"maxlength","maxlength":80,"path":"name","value":"Highlights of Vietnam Tour to Hanoi, Halong, Tam Hoc, Hoa Lu, Hue, Hoi An, Saigon"},"kind":"maxlength","path":"name","value":"Highlights of Vietnam Tour to Hanoi, Halong, Tam Hoc, Hoa Lu, Hue, Hoi An, Saigon"}},"_message":"Tour validation failed","message":"Tour validation failed: name: A tour name must have less than or equal to 80 characters"}},{"tour":{"name":"Toughest Northern Vietnam Motorbike Tour to Ba Be, Ha Giang, Sapa, Lai Chau, Son La","duration":8,"travelStyle":["Motorcycle Ride","Christmas & New Year"],"oldPrice":0,"price":1120,"summary":"Within 8 days, this Northern Vietnam offroad motorbike tour from Hanoi offers you full chance to taste Ha Giang, Ba Be National Park, Ba Be lake, Mai Chau valley and Sa pa – they are the most attractive destinations in North of Vietnam. You will have great album of stunning landscape of mountainous region and colorful hill tribes after 8 day riding motorbike in northern Vietnam. This is one of the most favourite in our Vietnam Motorbike Tours Collection.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d7a458c.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d7a458c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d7bc25a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d7c27e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d7c8a91.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d7cef0e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d7d55e8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d7dd42d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d7e3922.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d7e9e66.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d7f04bc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d80c204.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d812953.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d818c6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d81f2ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d8257f2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d82be7c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d832371.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189725_5e017b4d0b7fa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189725_5e017b4d1b1e7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189725_5e017b4d212ef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189725_5e017b4d27632.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189725_5e017b4d2d669.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189725_5e017b4d332e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189725_5e017b4d38b97.jpg"],"destinations":[],"timeline":[{"title":"Day 1: HANOI MOTORBIKE TOURS TO BA BE LAKE (240 KM)","description":"In and around HanoiThis great motorcycle tour to the north of Vietnam starts at around 8 AM. We try the best to avoid busy city road in the morning until Cho Chu town (in Thai Nguyen province) where we have lunch. After lunch, we surely have enjoyable motorcycle ride to Ba Be because the roads have less traffic and give you a lot of grand mountain view. At about 4 PM. We arrive Pac Ngoi – a beautiful village of Tay people which located peacefully at Ba Be lake’s side. Diner and stay with the Tay’s family. Ba Bể Lake (Vietnamese: Hồ Ba Bể – Ba means “Three”, Bể is from the Tay language word pé, meaning “lake”) is the largest natural lake in Vietnam. It is located in Nam Mẫu commune, Bắc Kạn district, Bắc Kạn Province in the northeastern region of the country. Having been formed approximately 200 million years ago, the lake is surrounded by limestone cliffs, which in turn are covered by primary forests.  The lake comprises three zones named Pé Lầm, Pé Lù, and Pé Lèng. Three rivers, named Năng, Tả Han, and Nam Cường, are the main inflows of the lake. The Năng river enters the lake through a large waterfall called Đầu Đẳng. In the lake there are also three islands, named Án Mã, Khẩu Cúm, and Po Gia Mải (literally “Widow’s Island”). Ba Bể Lake is a featured geographical science and is a biodiversity reservoir. It is a part of the Ba Be National Park. It is home of a range of animals and plants."},{"title":"Day 2: BABE LAKE MOTORCYCLE TOURS TO MEO VAC (170 KM)","description":"Saying good bye to  the family, we’ll ride motorbike on the back-roads through some rustic villages and the jungle. Then we motorbike across some streams. This promise to be a great day for off-road Vietnam motorbike touring. We will stop in Bao Lac town for lunch and then continue the beautiful motorcycle tour Northern Vietnam to Meo Vac by taking a scenic route climbs over many Passes where we can enjoy beautiful mountain ranges and the Nho Que river.  Arrive at Meo Vac by 5.00PM. Dinner in town, Hotel stay.  Meo Vac Town is located in the heart of the Dong Van Rock Plateau, which was recognized as part of the Global Geo-Park Network in 2009, the Dong Van old quarter is home to age old and unique architecture near Ha Giang Province’s border with China. Therefore, the Motorbike tour to Ha Giang, Dong Van is always the best choice of the motorcyclists."},{"title":"Day 3: MEO VAC MOTORBIKE TOURS HA GIANG (180 KM)","description":"Today’s ride promises to be the highlight of this motorcycle trip in north Vietnam as we will visit one of the most remote land in Motorbike Tour Around Northern Vietnam – 8 DaysVietnam where we can see many ethnic groups with their unique cultures and imposing mountains such as : Pi Leng Pass – one of the 4 longest and most beautiful passes in North Vietnam, the Rock Plateau, the Vuong palace in Dong Van, The “Heaven Gate” in Quan Ba.   This is for sure the best motorbike ride in Vietnam with many interesting and amazing things in every meter of the road.  Arrive Ha Giang in the late afternoon.Dinner and stay with the other Tay’s family or stay in hotel in Ha Giang city Ha Giang, 300 km away from Hanoi, located at the highest latitude in Vietnam. It is surrounded by Cao Bang, Tuyen Quang, Lao Cai, and Yen Bai. It shares a border with China in the north. Many ethnic minorities, including the Dao, H’mong, Tay, and Nung, live in Ha Giang province Vietnam.  "},{"title":"Day 4: HA GIANG MOTORBIKE TOURS TO SA PA (220KM)","description":"Today we head straight towards the North-western mountain where the main Fanxipan Mountain range dominates the road until Sapa. The road is very smooth with a good view of green mountain, rice fields between lovely villages of the hill tribes. After a short break in Lao Cai to see Chinese border, we will have very beautiful motorbike ride up to Sapa. This motorbike ride is up and up till 1.600 meters above sea level. It offers a great  view of mountain with terrace fields and it must be one of the best motorbike ride in North Vietnam. Arrive in Sapa at around 5: 00 pm, overnight at hotel in Sapa."},{"title":"Day 5: SAPA MOTORBIKE TOURS THAN UYEN (110 KM)","description":"You are free to explore Sapa until 1.30PM, check out hotel and we continue the route to Than Uyen, we will make a splendid climb up from Sapa to the top of the highest road pass in Vietnam (Tram Ton Pass). Crossing into Lai Chau Province at over 2000m above sea level. This is a short motorbike ride but could be the most enjoyable motorbike tour from Sa pa. The ride offers you amazing view of the Hoang Lien mountain ranges for miles and miles. We arrive in Than Uyen by 5.00PM.  Dinner and overnight in hotel."},{"title":"Day 6: THAN UYEN MOTORBIKE TOURS TO MU CANG CHAI – PHU YEN (220 KM)","description":"We keep riding up and down into a forested and high mountain region populated by H’mong peoples, We will hike up a very high mountain pass before descending into a mountainous tea-growing region. Soon after we follow a long the valley floor covered in a sea of rice surrounded by Hmong and Thai’s villages all the way to Phu Yen. Especially, after lunch in Mu Cang Chai – a famous land for terrace fields so the ride through Mu Cang Chai is another highlight of this Motorcycle tours North Vietnam. Arrive Phu Yen town at 5:00Pm. Overnight at hotel."},{"title":"Day 7: PHU YEN MOTORCYCLE TOURS TO MAI CHAU VALLEY (150 KM)","description":"It is a short motorbike tour to Mai Chau valley, but it’s also a enjoyable motorbike ride! It offers some different views from the days before with different hill tribes. Right after Phu Yen town, we will have great ride along the Da River lake on the winding road between the river lake and mountains. it is likely a motorcycle tour on the coastline in the central Vietnam.   After crossing the Da river by a ferry, we will motorcycle up and up to Moc Chau plateau where we stop for lunch, then after lunch, we’ll make a turn to the quiet mountain road named Hua Tat – it’s built by the French during the war time and nowadays, it is like a forgotten so the short ride to Mai Chau is also the best part of the Northern Vietnam Motorbike Tour. Arrive Mai Chau at 4:30 PM. Stay in Poom-coong village of the Thai people – Home stay."},{"title":"Day 8: MAI CHAU MOTORCYCLE TOURS BACK TO HANOI (150KM)","description":"Getting up late, feel the peaceful life of the local by walking around the valley and then start the motorbike ride back to Hanoi at around 10 AM. After 2 beautiful mountain passes – Thung Khe and Doc Cun we will have lunch and then join the high way back to Hanoi. We will be back to the hotel before rush hours in order to end the 8 Day motorbike tour in north Vietnam safely."}]},"error":{"errors":{"name":{"properties":{"message":"A tour name must have less than or equal to 80 characters","type":"maxlength","maxlength":80,"path":"name","value":"Toughest Northern Vietnam Motorbike Tour to Ba Be, Ha Giang, Sapa, Lai Chau, Son La"},"kind":"maxlength","path":"name","value":"Toughest Northern Vietnam Motorbike Tour to Ba Be, Ha Giang, Sapa, Lai Chau, Son La"}},"_message":"Tour validation failed","message":"Tour validation failed: name: A tour name must have less than or equal to 80 characters"}},{"tour":{"name":"Challenging Vietnam Motorcycle Tour to Ha Giang, Cao Bang via Sapa, Bac Ha, Yen Bai","duration":9,"travelStyle":["Motorcycle Ride","Christmas & New Year"],"oldPrice":0,"price":1318,"summary":"In this motorbike tour, we not only travel to the impressive destinations in Ha Giang Province, but also explore the amazing natural beauties in mountainous northern Vietnam with a ride from Hanoi to Vu Linh Village in Yen Bai to glance at the beauty of Thac Ba lake then Luc Yen and Lao Cai. From here, we’ll keep on our motorbike tour rolling to Bac Ha market then Ha Giang with Dong Van, Meo Vac, Bao Lac and Ba Be lake in Cao Bang before riding back to Hanoi.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa07675.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa07675.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa20ba8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa29bff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa31ec8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa3ba79.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa44b41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa4bd5e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa52993.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa5a14d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa623ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa69754.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa715ab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa79459.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa8184d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa89d12.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189715_5e002e3a23253.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189715_5e002e3a2fbcf.jpg"],"destinations":[],"timeline":[{"title":"Day 1: HANOI MOTORCYCLE TOURS TO VU LINH VILLAGE ( THAC BA LAKE, YEN BAI)","description":"In and around HanoiWe start our Motorbike tour by riding on to dyke roads following Red river to Thac Ba lake. See beautiful countryside, rice and green tea fields. Then we turn to the little road to Vu Linh village, where populated by Dzao ethnic minority by the side of Thac Ba lake, very friendly people and the welcome is exceptional. Home-stay in Vu Linh  Summary: Distance:  180 km Meals: Lunch, Dinner Accommodation: Home-stay"},{"title":"Day 2: THAC BA MOTORCYCLE TOURS TO LUC YEN (YEN BAI)","description":"After breakfast, we take the boat ride on Thac Ba lake, the biggest man-made lake in Vietnam. Stop by an island for swimming and discover the particularities of this area: the way villagers paddle their boats, the exotic and odd animals living around, the quiet and peaceful beauty of this huge lake, the lifestyle of the Dao among the thousands of islets. Back to home-stay for lunch. Get on the road, take a half-day ride through palm forest all the way to Luc Yen and stay in a family in the Tay territory. It’s a great home stay and the hosts are very welcoming. Home-stay in Luc Yen Summary: Distance:  100 km Meals: Breakfast, Lunch, Dinner Accommodation: Home-stay"},{"title":"Day 3: LUC YEN MOTORCYCLE TOURS TO BAC HA (LAO CAI)","description":"Motorcycle to get out to Road 70 up north to Khanh Hoa T-junction, turn to Road 153 to Bac Ha.This small highland town fills up to choking point on Sunday morning, when visitors flood in to meet the Flower H’mong at the morning market. Compared with Sapa, tourism is still in its infancy here and during the week the town has a deserted feel. Bac Ha is a good base to explore the surrounding highlands. Around 900m above sea level, it is noticeably warmer than Sapa. One of Bac Ha’s main industries is she manufacture of alcoholic home brews (rice wine, cassava wine and corn liquor). The corn hooch produced by the Flower H’mong is so potent it can ignite! Bac Ha is the only place in Vietnam where you’ll find this particular moonshine; there’s an entire area devoted to it at the Sunday market. Overnight in Bac Ha. Summary: Distance:  140 km Meals: Breakfast, Lunch, Dinner Accommodation: Home-stay"},{"title":"Day 4: BAC HA MOTORCYCLE TOURS TO HA GIANG CITY","description":"After breakfast, beautiful motor ride on the track to Xin Man and Hoang Su Phi on many small; back roads with scenic mountain views. Xin Man is right on the border between Vietnam and China. It is, as of this writing, well hidden and completely surrounded by wild mountains and forests. There’s a single road from Xin Man to Hoang Su Phi. Hoang Su Phi is among the most untouched area of Ha Giang Province of Vietnam. The area was separated from the mainstream society until very recently. Passing Hoang Su Phi, we will be charmed by the pristine beauty of the wild mountains and the authentic culture of the local ethnic groups which include: the Nung, the Flower H’mong, the Tay and the Ha Nhi People… After lunch, join the main road heading up to Ha Giang City, where we stop for the night and apply for a permit. Summary: Distance:  200 km Meals: Breakfast, Lunch  Accommodation: Hotel"},{"title":"Day 5: HA GIANG MOTORCYCLE TOURS TO DONG VAN","description":"After getting the permit for motorbike tour in border areas at Ha Giang’s Immigration Police, we ride on small challenging mountain roads (but incredibly beautiful) on the land of colorful mountain hill-tribes. Head up the Ma Pi Leng Pass. Here is yet another amazing place, with cloudy mountain ranges and the poetic Nho Que river winding off in the distance. It is really difficult to find the exact words to describe Ma Pi Leng Pass, located between Dong Van and Meo Vac, near the northernmost tip of Vietnam, as a painting of astonishing beauty and magnificence that captures the eyes of all viewers and nature lovers. Ride on a zig-zag track until reaching Vuong Family’s Residence, 14 kms before Dong Van. Vuong Family was considered the King of the Hmong People in Dong Van, Ha Giang. Their residence was built in the scenic valley of Sa Phin with Chinese architecture. The whole house was built out of wood and rock only. The rocks for the buildings were imported from China. Vuong Family Residence is a masterpiece of man work in the valley of heavenly beauty of Sa Phin. This is a remote area and we can meet the hard-working local people here. It is inspiring to see how they survive as they manage live in the rocks. When we reach Dong Van Town we will have some extra time to wonder the ancient streets lined with H’mong homes of clay bricks and tiles roofs built centuries ago. Summary: Distance:  160 km Meals: Breakfast, Lunch Accommodation: Hotel"},{"title":"Day 6: DONG VAN MOTORCYCLE TOURS PASSING MEO VAC TO BAO LAC (CAO BANG)","description":"The road is still under construction and tracks what make the ride relatively long in spite of few kilometres. The landscape is among the most beautiful of Vietnam, and the slow tempo is only more appreciable. We motorcycle across the wild regions of the mythical province of Ha Giang, Meo Vac is included. It shares the border with Dong Van District of Ha Giang Province and Bao Lam District of Cao Bang Province. Meo Vac has most of the terrain in the Rock Plateau of Dong Van and above 1000m above sea level. Meo Vac has a harsh climate in the winter which is from November to April with dry and freezing cold weather. It is inhabited by different ethnic minorities including the H’mong, the King, Tay, Dzao…Most ethnic groups have maintained their culture untouched from the outside world. In the afternoon, we stop for the night at Bao Lac, the ethnic crossroad of Northeast Vietnam. Many other ethnic groups on the two sides of the border meet at the market every Sunday. Summary: Distance:  80 km Meals: Breakfast, Lunch Accommodation: Hotel"},{"title":"Day 7: BAO LAC MOTORCYCLE TOURS TO BA BE NATIONAL PARK (BAC KAN)","description":"Beautiful motor ride down to Bac Kan Province. Few passes from where you can dominate the area. The road is easy but there are many blind curves before we turn to Ba Be lake (inside Ba Be National Park). Ba Be National Park is an abundant bioreserve area containing the world’s only fresh-water karst lake and several rare species of fauna and flora. Ba Be lake in VietnamThe biodiverse 10,048ha park – home to 1,268 species of flora and fauna, a series of caves and a gigantic fresh water lake – was established in 1992 by the Vietnamese Government to preserve forest ecosystems in the northeast. Ba Be is home to over 3,000 people from the ethnic minorities of Tay, Nung, Dao and Mong, who live in 13 villages within the park. The Tay people have inhabited Ba Be area for centuries and make up 58 per cent of the population within the park’s boundaries. Motorcycle into Bac Ngoi village, which is located inside Ba Be National Park. Our home-stay in Tay’s family is right by the side of Ba Be lake with wonderful and peaceful view. Summary: Distance:  140 km Meals: Breakfast, Lunch, Dinner Accommodation: Home-stay"},{"title":"Day 8: BA BE MOTORCYCLE TOURS TO NA HANG (BAC KAN)","description":"Half-day boat-ride on the lake to the other side, where we can explore Dau Dang waterfall on Nang river. As one of the 27 ASEAN heritage gardens, Ba Be has the potential to attract naturelovers with its 450ha natural fresh water lake, and 553 species of mammals, birds, reptiles, amphibians and fish. According to a survey from the Viet Nam Institute of Geo-sciences and Mineral Resources, over 11,000 years ago, an earthquake caused a collapse of the subterranean Nang River, creating a natural dam which led to the formation of Ba Be Lake. Lunch in a village near by Dau Dang waterfall before back to home-stay. Get on our bikes and take a half-day ride on countryside to Na Hang. This Nung’s village is in middle of nowhere. We have last experience on the trip to share the meals and house with locals. Summary: Distance:  80 km Meals: Breakfast, Lunch, Dinner Accommodation: Home-stay / Hotel"},{"title":"Day 9: NA HANG MOTORCYCLE TOURS BACK TO HANOI","description":"Easy motor ride in the morning, passing peaceful villages and rice fields before reaching very busy road in the afternoon. Traffic is getting worst and worst on Road 3, the way back to Hanoi, so we should be back before rush hour. Finish our trip around 4 pm  Summary: Distance:  160 km Meals: Breakfast, Lunch "}]},"error":{"errors":{"name":{"properties":{"message":"A tour name must have less than or equal to 80 characters","type":"maxlength","maxlength":80,"path":"name","value":"Challenging Vietnam Motorcycle Tour to Ha Giang, Cao Bang via Sapa, Bac Ha, Yen Bai"},"kind":"maxlength","path":"name","value":"Challenging Vietnam Motorcycle Tour to Ha Giang, Cao Bang via Sapa, Bac Ha, Yen Bai"}},"_message":"Tour validation failed","message":"Tour validation failed: name: A tour name must have less than or equal to 80 characters"}},{"tour":{"name":"Best Selling Saigon Motorbike Tour to Mekong Delta, Dalat, Nha Trang, Mui Ne and Vung Tau","duration":10,"travelStyle":["Motorcycle Ride","Christmas & New Year"],"oldPrice":0,"price":1310,"summary":"This Saigon Motorbike Tour to Dalat, Nha Trang, Mui Ne, and Vung Tau is the perfect way to discover not only evergreen Mekong Delta and romantic highlands city of Dalat but also the Southern part boasting the stunning sunny beaches in Nha Trang, Mui Ne and Vung Tau where you have chance to sit back and relax.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581c3579fe.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581c3579fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581c365826.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581504fb8b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581505501a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581503543e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e05815049fc0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581505b2da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581505fd60.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e05815066398.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581506d182.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581c36b570.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581c371135.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581c376cf7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581c37c6be.jpg"],"destinations":[],"timeline":[{"title":"Day 1: ARRIVAL – HO CHI MINH CITY (-/-/-)","description":"In and around Ho Chi Minh CityUpon landing at the airport at around 15:05, you’ll be welcome then escorted to your hotel for a check-in. The rest of time, you’ll be free to explore Saigon by night. Overnight at hotel.Start point\n Your Hotel, Hồ Chí Minh, Vietnam 08:00"},{"title":"Day 2: HO CHI MINH CITY MOTORBIKE TOUR TO MEKONG DELTA (B/L/-)","description":"In the morning, our motorbike tour will be started from your hotel in Ho Chi Minh City Saigon Motorcycle tours and depart to Can Duoc Market – a stunning rural market (40 km). The scene changes from bustling streets with buildings and noise to peaceful rice paddles with cottages and small houses on the way – in the open air of “steel horses”.  Then take a rural route to My Loi Ferry. Some stops en route to see farmers working on paddy fields. Cross Vam Co river by the ferry then ride to Go Cong then Tan Hoa (25km). Have some stops en-route to visit an incense workshop, through some remote villages and reach Tan Thanh beach for seafood lunch. Then continue riding from this Mekong Delta beach to My Tho(45km), the heart of the Mekong Delta.  Arrive My Tho, stop by the bank of Tien Giang River. Take a boat trip on Mekong River to Phoenix Island where local handicrafts and sweets from coconut are being produced. Enjoy fresh seasonal fruits and traditional live music and songs performance. Take a short ride to a typical local house to taste some homemade honey-tea.  Proceed by small sampan boats through the small canals and side arms of the river to observe the Tiengiang motorbike tours daily life along the river banks with a stop and short leisurely walk at the Turtle Island. Ride through Rach Mieu suspension-bridge for a breath-taking view of the Upper Mekong and transfer to Ho Chi Minh city (70 km). The trip ends at your hotel.  Summary: Distance: 190 km Meals: Lunch"},{"title":"Day 3: HO CHI MINH MOTORCYCLE TOUR TO BAO LOC – LAM DONG (B/L/D)","description":"Leave all chaos of Saigon behind, we’ll keep rolling the wheels to the Central Highlands and stop in the K’ho ethnic minority village to learn the culture of their wildlife at the edge of the Central Highlands. Arrive in Bao Loc after visiting Dambri waterfall – about 90 meters high then Tam Chau tea plateau & Linh Quy Phan An pagoda. Overnight in Bao Loc.  Bảo Lộc is a city of Lâm Đồng Province in the Central Highlands region of Vietnam. Bảo Lộc is famous for its registered trademark: B’lao tea. As of 2003, the town district had a population of 151,915. The district covers an area of 229 km2.  Meals: Breakfast, Lunch, Dinner Overnight at hotel in Bao Loc"},{"title":"Day 4: BAO LOC MOTORBIKE TOUR DALAT ( 140 KM – 5 HOUR RIDE) (B/L/D)","description":"In and around DalatLeaving Bao Loc for Dalat, visit the green tea farms, the cascade waterfall, Pongour, mushroom farms, silkworm villages, and silk processing chains, coffee plantations, mushrooms, vegetable, and flower farms, visit the highlights of the city like Crazy House, Flower Market, Dragon Pagoda. Arrive in Dalat around 5 pm.  Đà Lạt, the capital of Lâm Đồng Province in southern Vietnam’s Central Highlands, is centered around a lake and golf course and surrounded by hills, pine forests, lakes, and waterfalls. Known as the “City of Eternal Spring” for its distinctive temperate climate, Đà Lạt was developed as a resort by the French in the early 1900s, and many reminders of its colonial heritage remain.  Meals: Lunch, Dinner."},{"title":"Day 5: DA LAT OFFROAD MOTORBIKE TOUR TO BUON MA THUOT VIA LAK LAKE ~ 200 KM (B/L/D)","description":"After having breakfast at hotel, we’ll jump on our iron horses then keep riding to Buon Ma Thuot via Lak Lake. On the way, you can take a quick visit at the crazy house, travel along the country road to see the entire agriculture farm such as vegetable farm, greenhouse flower farm, coffee plantation, a visit of silkworm factory, rice wine making and elephant waterfall.  Arrive at Lak Lake with a visit to the “Jun” Minority Village (M’Nong). Crossing the Lak Lake by boat to Lieng minority village, with many opportunities of taking pictures of people farming and fishing Overnight at hotel in Buon Ma Thuot."},{"title":"Day 6: BUON MA THUOT OFFROAD MOTORCYCLE TOUR TO NHA TRANG ~ 210 KM (B/L/-)","description":"In and around Nha TrangToday, we say goodbye to the land of Coffee – Buon Ma Thuot to ride straight to Nha Trang. On the way, you have half an hour trekking to the top of the Elephant rock mountain, back on the road again, on the back of the motorbikes you will have opportunities to observe the panorama view of rice paddy field along the road, and then, a quick visit to the Ede Minority Village.  One more waterfall name: Dray Nao waterfall between Lak Lake and Nha Trang, Descend along the Phoenix Pass (affect by Agent Orange) and a visit the Hot spring, the brick-making factory, 20 km ride along the beach will lead you to the most Charming beach in Vietnam: Nha Trang beach then check in at hotel. Overnight at hotel in Nha Trang."},{"title":"Day 7: NHA TRANG SIGHTSEEING TOUR (B/L/-)","description":"08h30: Pick up at hotel & transfer to Cau Da harbor. 09h00: Take a boat trip to visit Bays in Nha Trang, which includes 19 big & small islands with imposing beauty. 10h00: Visit Hon Mun’s Preservation Area of Oceanic creatures. On this island, you will be steeped in the transparent cool water & diving to explore the coral reefs having been formed for 200 years with many kinds of precious fishes. 12h00: Come to Hon Mot Island for lunch on the boat. After having lunch, you may engage in a dancing & singing performance with many other visitors all over the world meanwhile enjoy free fruits & grape wine. 13h30: Arrive at Hon Tam Island, visit the statue of My Nhan Ngu & participate in sporting events in the water like Jeski, Gliding, volleyball….(Pay for yourself) 15h00: Visit fishing Village to learn more about their daily local life & get on the small bamboo boat to floating rafts. 16h00: Get back to Cau Da pier & transfer to hotel. Overnight at hotel in Nha Trang."},{"title":"Day 8: NHA TRANG MOTORBIKING TRIPS TO MUI NE CAPE (B/L/-)","description":"After having breakfast at hotel.  8h00: Our motorbike tour will start leaving to Mui Ne, on the way we will stop by Ca Na and some other beautiful beaches to take a break as well as photos or if needed, you can jump on the sea to soak up yourself. Upon arrival in Mui Ne, we’ll check-in at hotel then ride to a local restaurant for lunch. This afternoon, we will ride our bikes to visit Fishing villages, Hong Stream, Golden Sand Dunes and Flying Sand Dunes, right here you can engage some optional outdoor games to make funs by yourself such as skating on sand or flying a kite…  Last stop is at Bau Sen – a vast sand dune which has inspired numerous photographers for many years The rest of time, you could take a bath on Mui Ne beach and view sunset.  Overnight at hotel in Mui Ne"},{"title":"Day 9: MUI NE MOTORBIKE TOUR TO VUNG TAU VIA PHAN THIET (B/L/-)","description":"Breakfast at your hotel & check out. Back on our “steel horses” and we will keep riding along the coastal paved road, passing quiet pine forest of Loc An and we arrive Binh Chau hot spring, take a mud bath and relax on Hot Spring Lake. Having lunch at a local restaurant en-route.  In the afternoon, we’ll keep on riding to Phuoc Hai hamlet, we will be impressed by the beautiful scenery, especially the sections of road straddled by mountains and beaches then Minh Dam historical mountain and Long Phuoc Tunnels before reaching Vung Tau. Upon arrival, you’ll check in at hotel and relax by yourself.  Overnight at hotel in Vung Tau."},{"title":"Day 10: VUNG TAU MOTORBIKING TOURS BACK TO SAIGON – DEPARTURE (B/L/-)","description":"Breakfast at your hotel & then you’ll be at leisure on the beach or hanging around Vung Tau city till the time to ride back to the Tan Son Nhat airport in Saigon for a flight home."}]},"error":{"errors":{"name":{"properties":{"message":"A tour name must have less than or equal to 80 characters","type":"maxlength","maxlength":80,"path":"name","value":"Best Selling Saigon Motorbike Tour to Mekong Delta, Dalat, Nha Trang, Mui Ne and Vung Tau"},"kind":"maxlength","path":"name","value":"Best Selling Saigon Motorbike Tour to Mekong Delta, Dalat, Nha Trang, Mui Ne and Vung Tau"}},"_message":"Tour validation failed","message":"Tour validation failed: name: A tour name must have less than or equal to 80 characters"}},{"tour":{"name":"Hoi An Motorcycle Tour to Saigon on Ho Chi Minh Trail via Kham Duc, Kon Tum, Buon Ma Thuot, Dak Mil, Dong Xoai","duration":6,"travelStyle":["Motorcycle Ride","Trail/Dirt bikes","Sightseeing","Christmas & New Year"],"oldPrice":0,"price":980,"summary":"This 6-day Timeless Hoi An Motorcycle Tour to Saigon via Kon Tum, Buon Ma Thuot on Ho Chi Minh trail takes you on adventure rides to explore breathtaking landscapes of Central Highlands with coffee plantations, waterfalls, jungles and visit ethnic minorities in remote villages then taste great local foods at regions …","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/129836_5fab6792.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/129836_5fab6792.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_9963919f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_0cd07aa6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_247cb302.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_bba333e0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_787051ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_04032620.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_87071a10.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_3a58824c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_40d2e2f6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_d43b85c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_4fe03696.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_7ac07973.jpg"],"destinations":["Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hoi An motorbike tour to Kham Duc","description":"In and around Hoi An, Ho Chi Minh CitySaying goodbye with Hoi An ancient city, we will see how to make incense, visit Cham tower and Cao Dai Temple. Travelling on Ho Chi Minh trail, we will enjoy its magnificent scenery, exploring the rural life of the local people, learn their culture and customs We also learn more about the history of Vietnam and enjoy water massage on the Ho Chi Minh trail and the local market of the mountain town Arrive in Kham Duc around 5:00pm."},{"title":"Day 2: Kham Duc motorbike tour to Kon Tum","description":"Continuing Ho Chi Minh trail, today we will ride to Kon Tum. On the way, we will stop at Charlie Hill, Indochine three Corner, Dak To – Tan Canh battle field, Phoenix airport, Wooden church that is combined of European style and culture of the Central Highlands Vietnam and     Kon K’tu ethnic village with their tradition Rong House"},{"title":"Day 3: Kon Tum motorbike tour to Buon Me Thuot","description":"Wake up in the early morning to enjoy the fresh air of the highland town and walk around to visit Kon Tum market. After breakfast, we will get on the motorbike for visiting Sea lake – the eyes of Pleiku, War monument, Local house to learn how to make rice paper and rice noodle, Black pepper farm We will try to experience the daily life of local people Arriving in Buon Me Thuot around 5pm."},{"title":"Day 4: Buon Me Thuot motorbike tour to Dak Mil","description":"This is one of the best days of the tour, so don’t miss anything! Before leaving Buon Me Thuot, let’s enjoy the best coffee in Vietnam (Buon Me Thuot is coffee homeland of Vietnam) and visit Ede ethnic minority village where still keep their tradition long house and local market where we will buy really special foods for our picnic lu’nch in the national park Following Ho Chi Minh trail, we will head to the national park where we will visit the Dray Sap and Dray Nur Waterfall – Biggest one in the Central Highland, and swim in Fairy pool, take a water massage from waterfall. Then Our guide will cook special foods for the lunch (Secret). Overnight in Dak Mil (Near Vietnam and Cambodia border). "},{"title":"Day 5: Dak Mil motorbike tour to Dong Xoai","description":"We will Ride through the legendary Ho Chi Minh trail to enjoy its magnificent scenery, Explore the rural life of the local people and Learn more about the history of Vietnam. We continue to visit Soc Bom Bo village to understand S’tieng ethnic minority people culture and traditions and learn how the locals make rice papers, noodles,… Overnight in Dong Xoai (The beginning point of the Ho Chi Minh trail from South to North)"},{"title":"Day 6: Dong Xoai Motorbike Tour to Saigon","description":"After breakfast, we will get on the motorbike to head to Cu Chi tunnel. On the way, we will stop at Rubber tree plantations, War Victory Monument, Paddy field We will spend few hours to discover the Cu Chi tunnel and learn Vietnam History, then will ride to Sai Gon to finish the trip. Our guide will drop you off at the place you require."}]},"error":{"errors":{"name":{"properties":{"message":"A tour name must have less than or equal to 80 characters","type":"maxlength","maxlength":80,"path":"name","value":"Hoi An Motorcycle Tour to Saigon on Ho Chi Minh Trail via Kham Duc, Kon Tum, Buon Ma Thuot, Dak Mil, Dong Xoai"},"kind":"maxlength","path":"name","value":"Hoi An Motorcycle Tour to Saigon on Ho Chi Minh Trail via Kham Duc, Kon Tum, Buon Ma Thuot, Dak Mil, Dong Xoai"}},"_message":"Tour validation failed","message":"Tour validation failed: name: A tour name must have less than or equal to 80 characters"}},{"tour":{"name":"Best Selling Vietnam Motorcycle Tour to Central Highlands and Southern Coast with Da Lat, Nha Trang, Phan Thiet, Vung Tau","duration":7,"travelStyle":["Motorcycle Ride","Christmas & New Year"],"oldPrice":0,"price":1010,"summary":"This Vietnam Motorcycle Tour to Da Lat, Nha Trang, Phan Thiet, Vung Tau is an ideal combination between the Highlands and the Coast with a start from Saigon via Bao Loc, Lam Dong, Da Lat where you can have chance to visit grand coffee plantations, hill tribe's villages then downward to Nha Trang & along the beach to Phan Thiet, Mui Ne and Vung Tau to experience very beautiful beaches.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b8946cc99.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b8946cc99.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b8948c861.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b89493f2e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b8949c661.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b894a4bd5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b894ad9f6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b894b4901.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b894bbf50.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b894c5320.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b894ccecb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b894d49a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b894ddaa9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b894e6528.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189957_5e43722570f73.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189957_5e43722570f75.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189957_5e43722570f7b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189957_5e43722570f7c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189957_5e4372af0bba2.jpg"],"destinations":[],"timeline":[{"title":"Day 1: HO CHI MINH CITY MOTORBIKING TOURS TO BAO LOC – LAM DONG MOTORCYCLE TOURS TO DA LAT (-/L/D)","description":"In and around Ho Chi Minh CityThe journey northwards begins as we depart Ho Chi Minh and pass through The influence of the French is evident in local culture and architecture since Da Lat was founded as a hill retreat for the colonials to escape the oppressive heat in the coastal plains and the chaos of Saigon.  This charming town is set around a lake and surrounded by forests, waterfalls and rolling countryside. O/N in Da Lat. Activities: 250 km motors riding (6.5 hours) Offroad Biking over the mountains & jungles many tea and coffee plantations to the hill station of Da Lat, sometimes known as the “City of Eternal Spring”. The drive is long but views are fantastic all along the way. Once arriving in Da Lat we can soak up the cool climate as much as we want by spending our time to wander around and catch our first glimpse of this town.Start point\n Your Hotel, Hồ Chí Minh, Vietnam 08:00"},{"title":"Day 2: DA LAT OFFROAD MOTORBIKE TOURS TO LAK LAKE ~ 160 KM (8:30 – 16:30)","description":"What to see: on the way you can take a quick visit at the crazy house, travel along the country road to see the entire agriculture farm such as vegetable farm, greenhouse flower farm, coffee plantation, a visit of silkworm factory, rice wine making and elephant waterfall. Arrive at Lak Lake with a visit to the “Jun” Minority Village (M’Nong). Crossing the Lak Lake by boat to Lieng minority village, with many opportunities of taking pictures of people farming and fishing; Check-in at the long-stilt-house for the overnight stay. Where to stay: Homestay in Long Stilt house."},{"title":"Day 3: LAK LAKE OFFROAD MOTORCYCLE TOURS TO NHA TRANG ~ 210 KM (8:00 – 17:00)","description":"In and around Nha TrangWhat to see: on the way heading to Nha Trang, you have half an hour trekking to top of the Elephant rock mountain, back on the road again, on the back of the motorbikes you will have opportunities to observe the panorama view of rice paddy field along the road, and then, a quick visit to the Ede Minority Village.  One more waterfall name: Dray Nao waterfall between Lak Lake and Nha Trang, Descend along the Phoenix Pass (affect by Agent Orange) and a visit the Hot spring, the brick-making factory, 20 km ride along the beach will lead you to the most charming beach in Vietnam: Nha Trang beach then check-in at hotel. Overnight at hotel in Nha Trang."},{"title":"Day 4: NHA TRANG MOTORBIKING TRIPS TO MUI NE CAPE (B/L/D)","description":"After having breakfast at hotel. 8h00: Our motorbike tour will start leaving to Mui Ne, on the way we will stop by Ca Na and some other beautiful beaches to take a break as well as photos or if needed, you can jump on the sea to soak up yourself. Upon arrival in Mui Ne, we’ll check-in at a hotel then ride to a local restaurant for lunch.  This afternoon, we will ride our bikes to visit Fishing villages, Hong Stream, Golden Sand Dunes and Flying Sand Dunes, right here you can engage some optional outdoor games to make funs by yourself such as skating on sand or flying a kite… The rest of the time, you could take a bath on Mui Ne beach and view the sunset. Overnight at hotel in Mui Ne."},{"title":"Day 5: MUI NE CAPE MOTORBIKING TOURS TO PHAN THIET (B/L/D)","description":"Morning, breakfast & check out. Back on our motorbike and ride 35kms forwards to famous Phan Thiet. On the way, pay a visit at the Fairy Stream, then pause to discover the fishing village of Mui Ne and further on is the enormous red sand dunes. Continue your trip and enjoy the motor ride with a stop to discover how fishermen doing the daily work: net fishing, selling fish, mending the fishing net.  The last stop is at Bau Sen – a vast sand dune which has inspired numerous photographers for many years. We arrive in Phan Thiet around 2.00 PM. The rest of the day is your own at leisure. This day is also a chance for you to try windsurfing on beautiful beaches at Phan Thiet (optional).  Overnight in Phan Thiet.Phan Thiet – Ninh Chu.  Activities: 40 km riding in Phan Thiet (Mui Ne Cape) Swimming at Phan Thiet Beach"},{"title":"Day 6: PHAN THIET MOTORBIKING TOURS TO VUNG TAU (B/L/D)","description":"Breakfast at your hotel & check out. Back on our “steel horses” and we will keep riding along the coastal paved road, passing quiet pine forest of Loc An and we arrive Binh Chau hot spring, take a mud bath and relax on Hot Spring Lake. Having lunch at a local restaurant en-route.  In the afternoon, we’ll keep on riding to Phuoc Hai hamlet, we will be impressed by the beautiful scenery, especially the sections of road straddled by mountains and beaches then Minh Dam historical mountain and Long Phuoc Tunnels before reaching Vung Tau.  Upon arrival, you’ll check-in at hotel and relax by yourself. Overnight at hotel in Vung Tau."},{"title":"Day 7: VUNG TAU MOTORBIKING TOURS BACK TO SAIGON (B/L/-)","description":"Breakfast at your hotel & then you’ll be at leisure on the beach or hanging around Vung Tau city till the time to ride back to Saigon.  At around 16:30, you’ll get to your hotel.  End of the trip."}]},"error":{"errors":{"name":{"properties":{"message":"A tour name must have less than or equal to 80 characters","type":"maxlength","maxlength":80,"path":"name","value":"Best Selling Vietnam Motorcycle Tour to Central Highlands and Southern Coast with Da Lat, Nha Trang, Phan Thiet, Vung Tau"},"kind":"maxlength","path":"name","value":"Best Selling Vietnam Motorcycle Tour to Central Highlands and Southern Coast with Da Lat, Nha Trang, Phan Thiet, Vung Tau"}},"_message":"Tour validation failed","message":"Tour validation failed: name: A tour name must have less than or equal to 80 characters"}},{"tour":{"name":"Vietnam Highlights","duration":9,"travelStyle":["Discovery","Christmas & New Year"],"oldPrice":0,"price":666,"summary":"Traveling from North to South is the best direction to research the traditional culture and history of Vietnam before you reach its modern daily life. Excellent to visit World Heritages of Vietnam and to extend to Cambodia at the end by riverway.","highlights":["Stroll around the town crammed with bustling silk and fish markets in Hoi An","Experience the underground life of Vietnamese soldiers in the Cu Chi Tunnels","Wrap up in Hanoi and explore the fascinating Old Quarter and specialty shops"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/101732_762e1323.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/101732_762e1323.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_c478f1ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_5f67c353.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_93d5f612.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_f2b4f64a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_83087393.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_e1b9cd7d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_dbe593af.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_daab6fb1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_741bc409.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_603525a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_028440f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_6ef74016.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_cc4bccbd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_5a082f65.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_66cecf43.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_e58fab8e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_9025ecea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_8675f31b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_12334c7f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_88ae41b1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_1374354e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_e54f53eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_5938d91a.jpg"],"destinations":["Hanoi","Ninh Binh City","Halong Bay","Hoi An","Ho Chi Minh City","Cu Chi Tunnels","Mekong Delta"],"timeline":[{"title":"DAY 1: HANOI ARRIVAL – CITY TOUR (-/-/D)","description":"In and around HanoiWelcome to Hanoi – Vietnam! Upon arrival flight, the local driver will be welcoming you at Noi Bai airport; it takes us 35 minutes driving to the center of Hanoi then check-in at hotel.  Our tour guide will pick you at your hotel in the Old Quarter and then we get a Cyclo to Hoan Kiem Lake, one of the major scenic spots in the city and serves as a focal point for its public life to visit Ngoc Son temple and The Huc Bridge. And then we will stop at Hanoi Opera House, erected by the French colonial administration between 1901 and 1911.  After that, on the way to Water puppet show, we will see Sofitel Legend Metropole Hanoi Hotel - A Grand Dame of Southeast Asia that welcomes guests to experience her colonial grandeur and timeless elegance. Located steps from the Opera House in Hanoï’s French Quarter, this legendary property bring guests into intimate contact with the opulence of another era. A stage art invented by the Vietnamese peasants hundred years ago, with nearly 20 stories of Vietnam traditions and daily scenes will be the last activity. Finally we will take a walk on the streets of the old quarter and enjoy the Vietnamese traditional food: Beef noodles.  Night activities suggestion: enjoy local beer at Ta Hien Streets, experience the ambience of sleepless street with life music, the young people of Hanoi and also foreign tourists. Hundreds of bars and pubs in the Old Quarter are also at your disposal. Or just simple spend your time at shopping malls or various boutique Shops. Please note: Standard check in time is 14:00 Start point\n Noi Bai International Airport, Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam "},{"title":"DAY 2: HANOI – TAM COC – HOA LU - HANOI (B/L/-) - Group tour","description":"In and around Ho Chi Minh CityA 90km drive south of Hanoi will lead you to Ninh Binh, the site of the one capital city of ancient Vietnam before Hanoi took its leading role in 11th century. The area is featured by lots of well-known sceneries, which include Tam Coc Caves and Hoa Lu ancient capital with the old temples dedicated to King Dinh & King Le reigned in 10th century. The visit in Ninh Binh starts by a boat trip in Tam Coc where spectacular limestone karsts jut out from the green paddy fields reminding about Guilin (China) and Halong Bay of Vietnam, which gives this scenery the name “Halong-bay-on-land”. Back to your hotel in Hanoi later on. Overnight in Hanoi. "},{"title":"DAY 3: HANOI - HALONG - OVERNIGHT ON BOARD (B/L/D) - Group tour","description":"From Hanoi, at 8AM, head East for more than 3 hours to Halong Bay, the pride of the Gulf of Tonkin, a Natural World Heritage as designated by UNESCO in 1994. The road will pass by the Red River delta with green paddy fields and rural villages, where hard-work farmers are busy with their farming jobs, ploughing buffaloes or planting seedling. Upon arrival in Halong, we’ll take a big boat to cruise the Bay to discover the magnificent beauty of this “Descending-dragon” bay, created by thousands odd-shaped limestone rocks and karst grottoes. After a lunch of fresh seafood on board, we can visit the Surprising Grotto, stop for swimming or kayaking, passing floating villages and approach islets to enjoy their beauty in close distance. Back to the boat for dinner late afternoon. Evening attend activities on the boat or relax at your own leisure. Overnight on the boat near Titov Beach.  Please note! The program may be little varied upon the cruise you choose.  "},{"title":"DAY 4: HALONG – HANOI – DANANG – HOI AN (B/L/-) - Group tour","description":"In and around Hoi AnAfter breakfast, visit by boat to Luon Cave, a ring-shaped pool inside an island in Halong with absolutely tranquil landscape and emerald water. Back to the Wharf of Halong passing the most densely area with many islands that have been named like the Cock-Fighting Rock, Sail Island, Incense burner rock or Sea Dog Rock. Arrive at Halong Wharf around 11.00.  Take shuttle bus back to Hanoi. Our driver shall wait for you en route to continue the transfer to Noi Bai International Airport for a short flight to Danang.  Welcome at the airport then transfer along the coast to reach Hoi An Ancient Town to check in. Overnight in Hoi An. "},{"title":"DAY 5: HOI AN – HALF DAY CITY (B/-/-) - Group tour","description":"After breakfast at hotel, you take interesting walk over the tile-roofed Japanese Bridge, visit taciturn Chinese Assembly Halls, enjoy the attractiveness of ancient houses Tan Ky & Phung Hung, as well as Japanese Bridge. Later we can stop at shrines or stroll into the market located by Thu Bon river, where you may find the same feelings of the artists, who see the rooftops of Hoi An a magical old world of Oriental feel and source of inspiration. This is also a wonderful town to shop for lanterns, soft silk, raw silk, or get your clothes tailored within a day. Rest of day will be free on your own to discover the town or cycling (Bike rental on guest’s account) along Thu Bon to Cua Dai Beach. Overnight in Hoi An."},{"title":"DAY 6: HOI AN – HALF DAY SAIGON TOUR (B/-/-) - Group tour","description":"Relax till transfer to Da Nang Airport to take the midday flight to Saigon. You will be welcomed at the Tan Son Nhat airport and transfer to the hotel to check-in. Then we will join a half tour to have an overview of Saigon - the most dynamic city of Vietnam. Depart from your hotel to the Reunification Palace; this beautifully preserved palace was the residence of the President of the Republic of Vietnam. On April 30th 1975 the American War officially came to an end here. Enjoy a visiting the War Remnants Museum where you can see countless artifacts, photographs and pictures documenting the second Indochina war. Afterward, we visit The Notre Dame Cathedral, which was built in 1880, and the Old Post Office, which was built sometime between 1886 and 1891. It is one of the best examples of classical French colonial architecture. Our last stop would be at a local Market where you can practice your bargaining skills while shopping for souvenirs. Discover local life and culture. You’ll find some of the friendliest, liveliest, most convivial people in the city in here.  Overnight in Saigon."},{"title":"DAY 7: SAIGON – MEKONG DELTA – SAIGON (B/L/-) - Group tour","description":"After breakfast at hotel, picked by at hotel and drive heading to My Tho the homeland of coconut and family factories with local products like coconut candy, rice paper… Upon arrival, embark on the boat cruising on the mighty Mekong River viewing the life to the local people live along the banks. We stop at one of 4 islands in the area for sightseeing. Enjoy the fresh tropical fruits served in the heart of the garden accompanied by traditional southern Vietnamese folk music at the plantation. After that you will embark on the small boats rowed the local people thru the small cannels with water coconut tree to visit the local factories. There you will taste the honey tea and see the local people produce the coconut candy milk and of course you also can try it or stroll in the garden where the locals feed honeybee. We continue getting on the big boat to visit the vast area. Enjoy your lunch at a local restaurant nearby Mekong River. Afternoon, drive back to Saigon with stop to visit Vinh Trang pagoda, a famous pagoda in the area that its architecture is a mix of Chinese, Cambodian, and French culture. Overnight in Saigon. "},{"title":"DAY 8: SAIGON – CU CHI TUNNELS – SAIGON (B/-/-) - Group tour","description":"In and around Cu Chi TunnelsMorning visit Cu Chi Tunnels, one of the few remaining monuments to the Vietnam War. Beneath the ground lie 200 km of tunnels, dug by hand and inhabited by the forces of the Vietnamese guerillas during the conflict. At its peak, prior to the Tet Offensive in 1968, the tunnel complex was base to almost 10,000 troops. To this day, it remains one of the most impressive examples of how fierce the war used to be.  You even can try to crawl some dozens of m on the tunnel underground to have the real experience. Return to Saigon. Afternoon is at your own free time for shopping in the downtown where you can choose many lovely stuff at the very reasonable price. A few places to be mentioned to visit during your shopping is Ben Thanh Market – the center and typical market of Saigon; Saigon Square where is a few minutes walking from Ben Thanh Market; An Dong Plaza and its nearby Market; or Diamond Plaza and Thuong Xa Tax if you are seeking the high qualified and brand name goods.  Overnight in Saigon."},{"title":"DAY 9: SAIGON DEPARTURE (B/-/-)","description":"Breakfast at hotel. If your flight is in the  afternoon, you will have a half day more for the sightseeing and shopping before the departure till check out time and transfer to the airport for the departure flight back to your sweet home.   End of services! Please note: Standard check out time is around 12.00. End point\n Tan Son Nhat International Airport, Tan Son Nhat International Airport, Trường Sơn, Hồ Chí Minh, 736400, Vietnam "}]},"error":{"driver":true,"name":"MongoError","index":0,"code":11000,"keyPattern":{"name":1},"keyValue":{"name":"Vietnam Highlights"}}}]